BusinessProcesses/БПИнвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<BusinessProcess>
		<Properties>
			<Name>БПИнвентаризация</Name>
			<Comment>БП "Инвентаризация"</Comment>
			<Task>Task.ПроверкаИнвентаря</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инвентаризация</Name>
					<Comment>Инвентаризация</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЗаПоврежденноеИмущество</Name>
					<Comment>Оплата за поврежденное имущество</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаЗаПовережденноеИмуществоОбщежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПокупкаИнвентаря</Name>
					<Comment>Покупка инвентаря</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПокупкаИнвентаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КупитьИнвентарь</Name>
					<Comment>Купить инвентарь</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИнвентаря</Name>
					<Comment>Сумма инвентаря</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Documents/Инвентаризация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Инвентаризация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Инвентарь</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Студент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общежитие</Name>
					<Comment>Общежитие</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведенияИнвентаризации</Name>
					<Comment>Дата проведения инвентаризации</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбнаруженыНесоответствия</Name>
					<Comment>Обнаружены несоответствия</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_СломаноУтеряно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Студент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

BusinessProcesses/БПИнвентаризация/Ext/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	НужноЗаписать = Ложь;
		
	Если ЭтотОбъект.Инвентаризация.Пустая()Тогда 
		ИнвенОбъект = Документы.Инвентаризация.СоздатьДокумент();
		ИнвенОбъект.ДатаПроведенияИнвентаризации = ТекущаяДата();
		ИнвенОбъект.Записать();
		
		ЭтотОбъект.Инвентаризация = ИнвенОбъект.Ссылка;
		НужноЗаписать = Истина;
		
	КонецЕсли;
	
	Если НужноЗаписать Тогда 
		Записать();
	КонецЕсли;
	
	Сообщить("Старт бизнесс-процесса: " + """" + ЭтотОбъект.Метаданные().Синоним + """");
КонецПроцедуры

Процедура ПроведениеИнвентаризацииПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиПроведениеИнвентаризации(ФормируемыеЗадачи, СтандартнаяОбработка);
КонецПроцедуры
	  
Процедура ФормированиеЗадачиПроведениеИнвентаризации(ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		  
	Задача = Задачи.ПроверкаИнвентаря.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута = БизнесПроцессы.БПИнвентаризация.ТочкиМаршрута.ПроведениеИнвентаризации;
	Задача.Наименование = "Проведение инвентаризации";
	Задача.Должность = Справочники.Должности.Кладовщик;
	Задача.Подразделения = Справочники.Подразделения.Склад;
	Задача.Инвентаризация = Инвентаризация;	
	Задача.ОплатаЗаПоврежденноеИмущество = ОплатаЗаПоврежденноеИмущество;
	Задача.ПокупкаИнвентаря = ПокупкаИнвентаря;
	Задача.СуммаИнвентаря = Инвентаризация.СуммаДокумента;
	Задача.Записать();
	
	ФормируемыеЗадачи.Добавить(Задача); 

КонецПроцедуры


Процедура Условие1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	СтандартнаяОбработка = Ложь;
	СуммаДокумента = Инвентаризация.СуммаДокумента;
	Если Инвентаризация.ОбнаруженыНесоответствия Тогда
		 Результат = Истина;
		 Сообщить("Найдено несоответствие!");
	Иначе
		 Результат = Ложь;
		 Сообщить("Все хорошо, несоответсвий не найдено.");
	КонецЕсли;
КонецПроцедуры


Процедура ОпределениеСтудентаПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиОпределениеСтудента(ФормируемыеЗадачи, СтандартнаяОбработка);
КонецПроцедуры

Процедура ФормированиеЗадачиОпределениеСтудента(ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		  
	Задача = Задачи.ПроверкаИнвентаря.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута = БизнесПроцессы.БПИнвентаризация.ТочкиМаршрута.ОпределениеСтудента;
	Задача.Наименование = "Определение студента";
	Задача.Должность = Справочники.Должности.Бухгалтер;
	Задача.Подразделения = Справочники.Подразделения.Бухгалтерия;
	Задача.Инвентаризация = Инвентаризация;	
	Задача.ОплатаЗаПоврежденноеИмущество = ОплатаЗаПоврежденноеИмущество;
	Задача.ПокупкаИнвентаря = ПокупкаИнвентаря;
	Задача.СуммаИнвентаря = СуммаИнвентаря;
	Задача.Студент = Инвентаризация.Студент;
	Задача.Записать();
	
	ФормируемыеЗадачи.Добавить(Задача); 

КонецПроцедуры

Процедура Условие2ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ОплатаЗаПоврежденноеИмущество.ОплатаСтудентом;
КонецПроцедуры

Процедура ОплатаШтрафаЗаконнымПредставителемПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиОплатаШтрафаЗП(ФормируемыеЗадачи, СтандартнаяОбработка);
КонецПроцедуры

Процедура ФормированиеЗадачиОплатаШтрафаЗП(ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		  
	Задача = Задачи.ПроверкаИнвентаря.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута = БизнесПроцессы.БПИнвентаризация.ТочкиМаршрута.ОплатаШтрафаЗаконнымПредставителем;
	Задача.Наименование = "Оплата штрафа законным представителем";
	Задача.Должность = Справочники.Должности.Менеджер;
	Задача.Подразделения = Справочники.Подразделения.Администрация;
	Задача.Инвентаризация = Инвентаризация;	
	Задача.ОплатаЗаПоврежденноеИмущество = ОплатаЗаПоврежденноеИмущество;
	Задача.ПокупкаИнвентаря = ПокупкаИнвентаря;
	Задача.СуммаИнвентаря = СуммаИнвентаря;
	Задача.Студент = Инвентаризация.Студент;
	Задача.Платильщик = ОплатаЗаПоврежденноеИмущество.Платильщик;
	Задача.Записать();
	
	ФормируемыеЗадачи.Добавить(Задача); 

КонецПроцедуры

Процедура ОплатаШтрафаСтудентомПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиОплатаШтрафаСтуд(ФормируемыеЗадачи, СтандартнаяОбработка);
КонецПроцедуры

Процедура ФормированиеЗадачиОплатаШтрафаСтуд(ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		  
	Задача = Задачи.ПроверкаИнвентаря.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута = БизнесПроцессы.БПИнвентаризация.ТочкиМаршрута.ОплатаШтрафаЗаконнымПредставителем;
	Задача.Наименование = "Оплата штрафа студентом";
	Задача.Должность = Справочники.Должности.Менеджер;
	Задача.Подразделения = Справочники.Подразделения.Администрация;
	Задача.Инвентаризация = Инвентаризация;	
	Задача.ОплатаЗаПоврежденноеИмущество = ОплатаЗаПоврежденноеИмущество;
	Задача.ПокупкаИнвентаря = ПокупкаИнвентаря;
	Задача.СуммаИнвентаря = СуммаИнвентаря;
	Задача.Студент = Инвентаризация.Студент;
	Задача.Платильщик = ОплатаЗаПоврежденноеИмущество.Платильщик;
	Задача.Записать();
	
	ФормируемыеЗадачи.Добавить(Задача); 

КонецПроцедуры

Процедура ДействиеИсполнителяОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)	
	Если КупитьИнвентарь Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ЗакупитьИнвентарь;
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.ЗакончитьПроцесс;
    КонецЕсли;
КонецПроцедуры

Процедура ПокупкаИнвентаряПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормированиеЗадачиОплатаПокупкаИнвентаря(ФормируемыеЗадачи, СтандартнаяОбработка);
КонецПроцедуры

Процедура ФормированиеЗадачиОплатаПокупкаИнвентаря(ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		  
	Задача = Задачи.ПроверкаИнвентаря.СоздатьЗадачу();
	Задача.Дата = ТекущаяДата();
	Задача.БизнесПроцесс = Ссылка;
	Задача.ТочкаМаршрута = БизнесПроцессы.БПИнвентаризация.ТочкиМаршрута.ПокупкаИнвентаря;
	Задача.Наименование = "Покупка инвентаря";
	Задача.Должность = Справочники.Должности.Бухгалтер;
	Задача.Подразделения = Справочники.Подразделения.Бухгалтерия;
	Задача.Инвентаризация = Инвентаризация;	
	Задача.ОплатаЗаПоврежденноеИмущество = ОплатаЗаПоврежденноеИмущество;
	Задача.ПокупкаИнвентаря = ПокупкаИнвентаря;
	Задача.СуммаИнвентаря = СуммаИнвентаря;
	Задача.Студент = Инвентаризация.Студент;
	Задача.Платильщик = ОплатаЗаПоврежденноеИмущество.Платильщик;
	Задача.Записать();
	
	ФормируемыеЗадачи.Добавить(Задача); 

КонецПроцедуры

Процедура ПроведениеИнвентаризацииПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ Инвентаризация.Проведен Тогда
		СтандартнаяОбработка = Ложь;
		Сообщить("Документ-Инвентаризация не проведен ---- невозможно выполнить задачу!!!");
		Отказ = Истина;
	КонецЕсли; 
КонецПроцедуры


Процедура ОплатаШтрафаЗаконнымПредставителемПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ОплатаЗаПоврежденноеИмущество.Проведен Тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщить("Документ-ОплатаЗаПоврежденноеИмущество не проведен ---- невозможно выполнить задачу!!!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры


Процедура ПокупкаИнвентаряПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ПокупкаИнвентаря.Проведен Тогда
		
		СтандартнаяОбработка = Ложь;
		Сообщить("Документ-ПокупкаИнвентаря не проведен ---- невозможно выполнить задачу!!!");
		Отказ = Истина;
	КонецЕсли
КонецПроцедуры
